//10. С помощью оператора while напишите программу вывода всех четных чисел в диапазоне от 2 до 100 включительно.
public class Task10 {
	public static void main(String[] args) {
		int a;  
		 a = 2;
		 
		 while (a <= 100) {
		 System.out.print(a + "  ");
		 a = a + 2;
		 }
	}
}
